big_answer_questions = ["Расскажите, пожалуйста, в двух предложениях: как прошел Ваш день?",
              "Поделитесь в нескольких словах, что Вас сегодня порадовало за день?",
              "Скажите по секрету в нескольких словах, что Вам не понравилось в сегодняшнем дне?",
            "Расскажите ваши чувства о событиях сегодняшнего дня",
            "Расскажите, что вас сегодня удивило?",
                        "Поделитесь в нескольких предложениях, пожалуйста, было ли сегодня что-то сложное для Вас?",
                        "Расскажите, было ли сегодня что-то, что вас огорчило? Желательно, ответьте подробнее"]

# ========== тест-опросник "оценка настроения" =================
no_yes_questions_good = ["Ответьте на утверждение ДА или НЕТ: я чувствую себя исключительно бодро",
                    "Ответьте на утверждение ДА или НЕТ: у меня такое состояние, что, образно говоря, готов горы свернуть",
                    "Ответьте на утверждение ДА или НЕТ: у меня удивительное настроение - хочется петь и плясать, целовать от радости каждого, кого вижу",
                    "Ответьте на утверждение ДА или НЕТ: я иду радостно, не чувствую под собой ног",
                    "Ответьте на утверждение ДА или НЕТ: все люди без исключения кажутся мне благожелательными и симпатичными",
                    "Ответьте на утверждение ДА или НЕТ: я не вижу впереди никаких трудностей, все легко и доступно!",
                    "Ответьте на утверждение ДА или НЕТ: автомобили резко гудят на улице, но для меня эти звуки воспринимаются как приятная музыка"]

no_yes_questions_bad = ["Ответьте на утверждение ДА или НЕТ: окружающие меня люди очень мне надоели",
                    "Ответьте на утверждение ДА или НЕТ: я испытываю какое-то тягостное чувство",
                    "Ответьте на утверждение ДА или НЕТ: скорее бы испытать чувство покоя",
                    "Ответьте на утверждение ДА или НЕТ: хочу, чтобы меня оставили в покое, не беспокоили бы",
                    "Ответьте на утверждение ДА или НЕТ: неудачи вызывают чувство неудовлетворенности",
                    "Ответьте на утверждение ДА или НЕТ: вокруг меня очень много людей, способных сделать мне зло, от любого человека можно ожидать неблаговидного поступка",
                    "Ответьте на утверждение ДА или НЕТ: все постройки на улицах кажутся мне удивительно неудачными",
                    "Ответьте на утверждение ДА или НЕТ: я каждому, кого встречаю, способен сказать грубость",
                    "Ответьте на утверждение ДА или НЕТ: мне никого не хочется видеть, ни с кем не хочется разговаривать",
                    "Ответьте на утверждение ДА или НЕТ: настроение такое, что хочется сказать \"Пропади все пропадом!\"",
                    "Ответьте на утверждение ДА или НЕТ: мне хочется всем сказать \"Перестаньте меня беспокоить, отвяжитесь!\"",
                    "Ответьте на утверждение ДА или НЕТ: мое будущее мне кажется очень печальным",
                    "Ответьте на утверждение ДА или НЕТ: бывает и хуже, но редко",
                    "Ответьте на утверждение ДА или НЕТ: я не верю даже самым близким людям"]


# Методика самооценки психических состояний Г. Айзенка
rate_questions = ["По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я не чувствую в себе уверенности",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: часто из-за пустяков краснею",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: мой сон беспокоен",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я легко впадаю в уныние",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я беспокоюсь о только воображаемых еще неприятностях",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: меня пугают трудности",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: люблю копаться в своих недостатках",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: меня легко убедить",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я мнительный человек",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я с трудом переношу время ожидания",

                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: нередко мне кажутся безвыходными положения, из которых можно найти выход",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: неприятности меня сильно расстраивают, я падаю духом",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: при больших неприятностях я склонен без достаточных оснований винить себя",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: несчастья и неудачи ничему меня не учат",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я часто отказываюсь от борьбы, считая ее бесплодной",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я нередко чувствую себя беззащитным",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: иногда у меня бывает состояние отчаяния",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я чувствую растерянность перед трудностями",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: в трудные минуты жизни иногда веду себя по-детски, хочу, чтобы меня пожалели",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: считаю недостатки своего характера неисправимыми",

                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я оставляю за собой последнее слово",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я нередко в разговоре перебиваю собеседника",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: меня легко рассердить",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я люблю делать замечания другим",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я хочу быть авторитетом для окружающих",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я не довольствуюсь малым, хочу наибольшего",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: когда разгневаюсь, я плохо себя сдерживаю",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я предпочитаю руководить, чем подчинять",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: у меня резкая, грубоватая жестикуляция",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я мстителен",

                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: мне трудно менять привычки",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я нелегко переключаю внимание",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я очень настороженно отношусь ко всему новому",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: меня трудно переубедить",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: нередко у меня не выходят из головы мысли, от которых следовало бы освободиться",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я нелегко сближаюсь с людьми",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: меня расстравивают даже незначительные нарушения плана",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: нередко я проявляю упрямство",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я неохотно иду на риск",
                  "По шкале от 1 до 5, где 1 - не согласен и 5 - согласен, ответьте на утверждение: я резко переживаю отклонения от принятого мною режима"]


def get_baq(id:int):
    return big_answer_questions[id]
def get_neq_good(id:int):
    return no_yes_questions_good[id]
def get_neq_bad(id:int):
    return no_yes_questions_bad[id]
def get_rq(id:int):
    return rate_questions[id]

def get_size_baq():
    return len(big_answer_questions)
def get_size_neq_good():
    return len(no_yes_questions_good)
def get_size_neq_bad():
    return len(no_yes_questions_bad)
def get_size_rq():
    return len(rate_questions)

